In [155]:
import pandas as pd
import numpy as np

In [156]:
df = pd.read_excel('Data.xlsx')

In [157]:
df.head()

            Unnamed: 0        Apple         Goole        IBM  SPX Index
0                 Date  Apple_Price  Google_Price  IBM_Price  SPX_Price
1  2010-01-04 00:00:00        7.643       313.679     132.45    1132.98
2  2010-01-05 00:00:00        7.656       312.297     130.85    1136.52
3  2010-01-06 00:00:00        7.535       304.425        130    1137.14
4  2010-01-07 00:00:00        7.521       297.338     129.55     1141.7

In [158]:
df.columns = df.iloc[0]

In [159]:
df.head()

0                 Date  Apple_Price  Google_Price  IBM_Price  SPX_Price
0                 Date  Apple_Price  Google_Price  IBM_Price  SPX_Price
1  2010-01-04 00:00:00        7.643       313.679     132.45    1132.98
2  2010-01-05 00:00:00        7.656       312.297     130.85    1136.52
3  2010-01-06 00:00:00        7.535       304.425        130    1137.14
4  2010-01-07 00:00:00        7.521       297.338     129.55     1141.7

In [160]:
df = df.iloc[1:]

In [161]:
df.head()

0                 Date Apple_Price Google_Price IBM_Price SPX_Price
1  2010-01-04 00:00:00       7.643      313.679    132.45   1132.98
2  2010-01-05 00:00:00       7.656      312.297    130.85   1136.52
3  2010-01-06 00:00:00       7.535      304.425       130   1137.14
4  2010-01-07 00:00:00       7.521      297.338    129.55    1141.7
5  2010-01-08 00:00:00       7.571      301.302    130.85   1144.98

In [162]:
df.Date = df.Date.dt.date

In [163]:
df.shape

(2264, 5)

In [164]:
# df.set_index('Date',inplace=True)

In [165]:
# df.head(6)

In [166]:
missing_dates = pd.date_range(df.Date.min(), df.Date.max()).difference(df.index)

In [167]:
print(missing_dates)
print(len(missing_dates))

DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
               '2010-01-08', '2010-01-09', '2010-01-10', '2010-01-11',
               '2010-01-12', '2010-01-13',
               ...
               '2018-12-22', '2018-12-23', '2018-12-24', '2018-12-25',
               '2018-12-26', '2018-12-27', '2018-12-28', '2018-12-29',
               '2018-12-30', '2018-12-31'],
              dtype='datetime64[ns]', length=3284, freq=None)
3284

In [168]:
# adding missing dates
idx = pd.date_range(start=df.Date.min(), end=df.Date.max())

In [169]:
df = df.set_index('Date').reindex(idx).rename_axis('Date').reset_index()

In [170]:
df.set_index('Date',inplace=True)

In [171]:
df.head(10)

0          Apple_Price Google_Price IBM_Price SPX_Price
Date
2010-01-04       7.643      313.679    132.45   1132.98
2010-01-05       7.656      312.297    130.85   1136.52
2010-01-06       7.535      304.425       130   1137.14
2010-01-07       7.521      297.338    129.55    1141.7
2010-01-08       7.571      301.302    130.85   1144.98
2010-01-09         NaN          NaN       NaN       NaN
2010-01-10         NaN          NaN       NaN       NaN
2010-01-11       7.504      300.846    129.48   1146.98
2010-01-12       7.419      295.526    130.51   1136.22
2010-01-13       7.523      293.829    130.23   1145.68

In [154]:
df.shape

(3284, 4)

In [173]:
# Fill all NaN with previous values
df.fillna(method='ffill',inplace=True)

In [174]:
df.head(10)

0           Apple_Price  Google_Price  IBM_Price  SPX_Price
Date
2010-01-04        7.643       313.679     132.45    1132.98
2010-01-05        7.656       312.297     130.85    1136.52
2010-01-06        7.535       304.425     130.00    1137.14
2010-01-07        7.521       297.338     129.55    1141.70
2010-01-08        7.571       301.302     130.85    1144.98
2010-01-09        7.571       301.302     130.85    1144.98
2010-01-10        7.571       301.302     130.85    1144.98
2010-01-11        7.504       300.846     129.48    1146.98
2010-01-12        7.419       295.526     130.51    1136.22
2010-01-13        7.523       293.829     130.23    1145.68

In [175]:
df.isnull().sum()

0
Apple_Price     0
Google_Price    0
IBM_Price       0
SPX_Price       0
dtype: int64